---
kind: method
id: M:Autodesk.Revit.DB.Analysis.AnalysisDisplayDiagramSettings.#ctor
source: html/b252ae90-93a4-aa22-38da-ea1c24f38fc2.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayDiagramSettings.#ctor Method

Constructs a default instance of diagram settings.

## Syntax (C#)
```csharp
public AnalysisDisplayDiagramSettings()
```